for completion, example of why you need an explicit `ignore_changes`:
```
  # aws_vpc_ipam_pool_cidr_allocation.test must be replaced
-/+ resource "aws_vpc_ipam_pool_cidr_allocation" "test" {
      ~ cidr                    = "172.2.0.0/28" -> "172.2.0.16/28" # forces replacement
      ~ id                      = "ipam-pool-alloc-0557c6b52a2924228b9d96b20590301ae_ipam-pool-0a9057b39924035a3" -> (known after apply)
      ~ ipam_pool_allocation_id = "ipam-pool-alloc-0557c6b52a2924228b9d96b20590301ae" -> (known after apply)
      + resource_id             = (known after apply)
      ~ resource_owner          = "690256092611" -> (known after apply)
      ~ resource_type           = "custom" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ preview_cidr = {
      ~ cidr             = "172.2.0.0/28" -> "172.2.0.16/28"
      ~ id               = "172.2.0.0/28_ipam-pool-0a9057b39924035a3" -> "172.2.0.16/28_ipam-pool-0a9057b39924035a3"
        # (3 unchanged elements hidden)
    }
```

After a cidr range is allocated, the preview command finds a _new_ one and cascades required changes to the allocation.